{"bibliografia":[{"text":"Kroll, P.; Kruchten, Ph. , The Rational Unified Process Made Easy. A Practioner's Guide to the RUP. , Addison wesley , 2004 ,  , ISBN: 0-321-16609-4","url":""},{"text":"Kurbel, K.E. , The Making of Information Systems. Software engineering and Management in a Globalizaed World , Springer Verlag , 2008 ,  , ISBN: 978-3-540-79260-4","url":""}],"professors":[{"email":"mayol@essi.upc.edu","nom":"ENRIQUE MAYOL SARROCA"}],"idAssig":"DSI","descripcio":["Saber descriure les principals responsabilitats d'un administrador de la base de dades","Explicar què és una metodologia de desenvolupament de SI i explicar les diferències entre diferents metodologies concretes.","Definir en què consisteix el disseny de SI i els principis que guien aquest procés.","Definir el concepte d'arquitectura de SI, explicar alguns dels patrons arquitectònics més importants i les seves característiques.","Saber realitzar el disseny d'un SI senzill basat en una arquitectura en capes.","Saber descriure en què consisteix la integració de components i\/o aplicacions, així com els nivells i topologies d'integració.","Ser conscient de la necessitat de tenir un coneixement continuat i actualitzat dels nous tipus de SI que requereix el mercat, de les noves tecnologies disponibles i de les noves metodologies de disseny.","Entendre i saber escollir entre diferents alternatives per a la construcció i implantació d'un SI a l'organització.","Conèixer en què consisteix l'externalització del desenvolupament d'un SI, les estratègies existents, les decisions a prendre, així com avantatges i inconvenients.","Realitzar el disseny lògic de la bases de dades per a un SI a partir de l'esquema conceptual i usant patrons de gestió de la persistència.","Saber descriure en què consisteix l'adquisició de paquets estàndard, els criteris de selecció i les tècniques d'adaptació, d'extensió i de parametrització."],"status":"0","credits":"6","nom":"DISSENY DE SISTEMES D'INFORMACIÓ","bibliografiaComplementaria":[{"text":"Larman, Craig , Applying UML and patterns : an introduction to object- oriented analysis and design and iterative development , Upper Saddle River, N.J. Prentice Hall PTR , 2005 , 3a , ISBN: 0131489062","url":""}]}
